Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОчередьРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОчередьРаспределения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонцаБронирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПродлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнимПисалОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыйЧат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЖурналХолодногоЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЖурналХолодногоЗапуска</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыХранилищФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыХранилищФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛокальныйКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСоединения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщениеСБотом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеОчереди</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonForms/iga_ФормаКонстант/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка значения по умолчанию при первом запуске
	Если НаборКонстант.iga_ТипХранилищаФайлов.Пустая() Тогда
		НаборКонстант.iga_ТипХранилищаФайлов = ПредопределенноеЗначение("Перечисление.iga_ТипыХранилищФайлов.ЛокальныйКаталог");
	КонецЕсли;
	
	УстановитьВидимостьПолей();
	
	УстановкаДоступностиКнопокБота(Элементы, НаборКонстант);
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ОбработкаОповещенийВЧатах);
	ОбработчикОповещенийВЧатах = РеглЗадание.Использование;
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ПроверкаОператоровНаОнлайн);
	ПроверкаОператоровНаОнлайн = РеглЗадание.Использование;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановкаДоступностиКнопокБота(Элементы, НаборКонстант)
	
	Элементы.ЗапуститьБота.Доступность = Не НаборКонстант.iga_ЧатБотИспользуется;
	Элементы.ХолодныйЗапуск.Доступность = Не НаборКонстант.iga_ЧатБотИспользуется;
	Элементы.Отключить.Доступность = НаборКонстант.iga_ЧатБотИспользуется;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипХранилищаПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей()
	
	ТипХранилища = НаборКонстант.iga_ТипХранилищаФайлов;
	ЭтоFTP = (ТипХранилища = ПредопределенноеЗначение("Перечисление.iga_ТипыХранилищФайлов.FTP"));
	
	// Поля FTP видны только при выборе FTP
	Элементы.iga_ПользовательFTP.Видимость = ЭтоFTP;
	Элементы.iga_ПарольFTP.Видимость = ЭтоFTP;
	Элементы.iga_ПортFTP.Видимость = ЭтоFTP;
	Элементы.iga_ИспользоватьБезопасноеСоединениеFTP.Видимость = ЭтоFTP;
	
	// Подсказка для пути
	Если ТипХранилища = ПредопределенноеЗначение("Перечисление.iga_ТипыХранилищФайлов.FTP") Тогда
		Элементы.iga_ПутьККаталогуФайлов.ПодсказкаВвода = "Например: ftp.myserver.com";
	Иначе
		Элементы.iga_ПутьККаталогуФайлов.ПодсказкаВвода = "Например: C:\WhatsAppFiles или \\Server\Share";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьДоступность(Команда)
	
	РезультатПроверки = ПроверитьДоступностьНаСервере();
	
	Если РезультатПроверки.Успех Тогда
		ПоказатьПредупреждение(, "Проверка выполнена");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.Сообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДоступностьНаСервере()
	
	Результат = Новый Структура("Успех, Сообщение", Ложь, "");
	
	ТипХранилища = НаборКонстант.iga_ТипХранилищаФайлов;
	Путь         = НаборКонстант.iga_ПутьККаталогуФайлов;
	
	Если ПустаяСтрока(Путь) Тогда
		Результат.Сообщение = "Путь к каталогу не заполнен!";
		Возврат Результат;
	КонецЕсли;

	Если ТипХранилища <> ПредопределенноеЗначение("Перечисление.iga_ТипыХранилищФайлов.FTP") Тогда
		
		// Проверка папки (Локальной или Сетевой)
		Попытка
			// Создаем тестовый каталог и файл
			// На сервере проверяем через создание временного файла
			ИмяТестФайла = Путь + ?(Прав(Путь,1)="\","","\") + "1c_test_write_" + Формат(ТекущаяДата(), "ДФ=yyyyMMddHHmmss") + ".tmp";
			ТестЗапись = Новый ЗаписьТекста(ИмяТестФайла);
			ТестЗапись.Записать("Проверка прав доступа 1С");
			ТестЗапись.Закрыть();
			
			УдалитьФайлы(ИмяТестФайла);
			
			Результат.Успех = Истина;
			Результат.Сообщение = "Доступ к каталогу подтвержден (запись разрешена).";
		Исключение
			Результат.Сообщение = "Ошибка доступа к каталогу: " + ОписаниеОшибки();
		КонецПопытки;
		
	Иначе
		
		// Проверка FTP
		Попытка
			FTPСоединение = Новый FTPСоединение(Путь, 
				НаборКонстант.iga_ПортFTP, 
				НаборКонстант.iga_ПользовательFTP, 
				НаборКонстант.iga_ПарольFTP, 
				, // Прокси
				НаборКонстант.iga_ИспользоватьБезопасноеСоединениеFTP);
			
			FTPСоединение.УстановитьТекущийКаталог("/");
			
			Результат.Успех = Истина;
			Результат.Сообщение = "Соединение с FTP успешно установлено.";
		Исключение
			Результат.Сообщение = "Ошибка FTP соединения: " + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВебХукПоУмолчаниюНаСервере()
	
	НаборКонстант.iga_webhookUrl = iga_ОбщегоНазначенияКлиентСервер.РазобратьURL(Обработки.iga_ChatBot.Создать().ХостВебхуковПоУмолчанию()).Хост;
	
КонецПроцедуры

&НаКлиенте
Процедура ВебХукПоУмолчанию(Команда)
	ВебХукПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбычныйЗапуск(Команда)
	
	Ответ = Ждать ВопросАсинх("Запустить бота?",
	РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, "Запуск бота", КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	НаборКонстант.iga_ЧатБотИспользуется = Истина;
	
	Записать();

	УстановкаДоступностиКнопокБота(Элементы, НаборКонстант);
КонецПроцедуры

&НаСервере
Процедура ПодготовитьЧатыКХолодномуЗапуску(ДатаНачала, Причина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	НЕ iga_ОчередьРаспределения.Статус = &СтатусЗавершен";
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.iga_СтатусыОчереди.Завершен);
	ВыборкаОчереди = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОчереди.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.iga_ОчередьРаспределения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Чат.Установить(ВыборкаОчереди.Чат);
		НаборЗаписей.Записать();
			
	КонецЦикла;
	
	ЗаписьЗапуска = РегистрыСведений.iga_ЖурналХолодногоЗапуска.СоздатьМенеджерЗаписи();
	ЗаписьЗапуска.Период = ТекущаяДата();
	ЗаписьЗапуска.Пользователь = Пользователи.ТекущийПользователь();
	ЗаписьЗапуска.Причина = Причина;
	ЗаписьЗапуска.ДатаНачала = ДатаНачала;
	ЗаписьЗапуска.Записать();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ХолодныйЗапуск(Команда)
	
	Ответ = Ждать ВопросАсинх("Выполнить холодный запуск? Данный запуск выполняется только в случае долгой неактивности бота.",
		РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, "Запуск бота", КодВозвратаДиалога.Нет);
		
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Причина = Ждать ВвестиСтрокуАсинх("Продолжительный простой бота.", "Введите причину", 1000, Истина);
	
	Если Причина = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПериода = Ждать ВвестиДатуАсинх(ТекущаяДата() - 3600, "Введите дату и время начала", ЧастиДаты.ДатаВремя);
	
	Если Не ЗначениеЗаполнено(ДатаНачалаПериода) Или ДатаНачалаПериода >= ТекущаяДата() Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант.iga_ЧатБотИспользуется = Истина;

	ПодготовитьЧатыКХолодномуЗапуску(ДатаНачалаПериода, Причина);	
	
	Записать();
	
	УстановкаДоступностиКнопокБота(Элементы, НаборКонстант);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Отключить(Команда)
	
	Ответ = Ждать ВопросАсинх("Отключить бота?",
		РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, "Запуск бота", КодВозвратаДиалога.Нет);
		
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант.iga_ЧатБотИспользуется = Ложь;
	
	Записать();
	
	УстановкаДоступностиКнопокБота(Элементы, НаборКонстант);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийХэшБазы()
	
	ХешБазы = iga_ОбщегоНазначенияСервер.ПолучитьТекущийХэшБазы();
	
	Возврат ХешБазы;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьИсториюНаСервере(ДатаНачала, ДатаОкончания)
	
	iga_МетодыРаботыСБотом.ЗагрузитьИсториюСообщений(ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьИсториюСообщений(Команда)
	
	ДатаНачала = Ждать ВвестиДатуАсинх(iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ТекущаяДата(), "ЧАС", -1), "Дата начала", ЧастиДаты.ДатаВремя);
	Если ДатаНачала = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ДатаОкончания = Ждать ВвестиДатуАсинх(ТекущаяДата(), "Дата окончания", ЧастиДаты.ДатаВремя);
	Если ДатаОкончания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИсториюНаСервере(ДатаНачала, ДатаОкончания);
	
	ПредупреждениеАсинх("Операция загрузки завершена", 60, "Загрузка истории");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьХешБазы(Команда)
	
	ХешБазы =ПолучитьТекущийХэшБазы();
	Элементы.ХешБазы.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ОбработкаОповещенийВЧатах);
	РеглЗадание.Использование = ОбработчикОповещенийВЧатах;
	РеглЗадание.Записать();
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ПроверкаОператоровНаОнлайн);
	РеглЗадание.Использование = ПроверкаОператоровНаОнлайн;
	РеглЗадание.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасписание(ИмяОбработчика)
	
	Если ИмяОбработчика = "ОбработчикОповещенийВЧатах" Тогда
		Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ОбработкаОповещенийВЧатах).Расписание;
	Иначе
		Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ПроверкаОператоровНаОнлайн).Расписание;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьРасписание(ИмяОбработчика, Расписание)
	
	Если ИмяОбработчика = "ОбработчикОповещенийВЧатах" Тогда
		РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ОбработкаОповещенийВЧатах);
		РеглЗадание.Расписание = Расписание;
		РеглЗадание.Записать();
	Иначе
		РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.iga_ПроверкаОператоровНаОнлайн);
		РеглЗадание.Расписание = Расписание;
		РеглЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура РасписаниеОповещений(Команда)
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(ПолучитьРасписание(("ОбработчикОповещенийВЧатах")));
	Расписание = Ждать ДиалогРасписания.ОткрытьАсинх();
	Если Расписание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьРасписание("ОбработчикОповещенийВЧатах", Расписание);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура РасписаниеПроверкиОператоров(Команда)
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(ПолучитьРасписание((" ")));
	Расписание = Ждать ДиалогРасписания.ОткрытьАсинх();
	Если Расписание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьРасписание(" ", Расписание);
	
КонецПроцедуры
